# RiseDropAnnotationSize Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTraySettings..::..RiseDropAnnotationSize Property
CableTraySettings Class See Also
---
The rise drop annotation size.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double RiseDropAnnotationSize { get; set; }
```

Visual Basic
---
```text
Public Property RiseDropAnnotationSize As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double RiseDropAnnotationSize {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for riseDropAnnotationSize must be between 0 and 30000 feet. |

# See Also
CableTraySettings Class
Autodesk.Revit.DB.Electrical Namespace